codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efh124.h
#define _ADCCMPCON4_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON4_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON4_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPED_POSITION              0x00000005
#define _ADCCMPCON4_DCMPED_MASK                  0x00000020
#define _ADCCMPCON4_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON4_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON4_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON4_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON4_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON4_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON4_AINID_POSITION               0x00000008
#define _ADCCMPCON4_AINID_MASK                   0x00001F00
#define _ADCCMPCON4_AINID_LENGTH                 0x00000005

#define _ADCCMPCON5_IELOLO_POSITION              0x00000000
#define _ADCCMPCON5_IELOLO_MASK                  0x00000001
#define _ADCCMPCON5_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON5_IELOHI_POSITION              0x00000001
#define _ADCCMPCON5_IELOHI_MASK                  0x00000002
#define _ADCCMPCON5_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON5_IEHILO_POSITION              0x00000002
#define _ADCCMPCON5_IEHILO_MASK                  0x00000004
#define _ADCCMPCON5_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON5_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON5_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON5_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON5_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON5_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON5_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON5_DCMPED_POSITION              0x00000005
#define _ADCCMPCON5_DCMPED_MASK                  0x00000020
#define _ADCCMPCON5_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON5_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON5_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON5_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON5_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON5_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON5_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON5_AINID_POSITION               0x00000008
#define _ADCCMPCON5_AINID_MASK                   0x00001F00
#define _ADCCMPCON5_AINID_LENGTH                 0x00000005

#define _ADCCMPCON6_IELOLO_POSITION              0x00000000
#define _ADCCMPCON6_IELOLO_MASK                  0x00000001
#define _ADCCMPCON6_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON6_IELOHI_POSITION              0x00000001
#define _ADCCMPCON6_IELOHI_MASK                  0x00000002
#define _ADCCMPCON6_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON6_IEHILO_POSITION              0x00000002
#define _ADCCMPCON6_IEHILO_MASK                  0x00000004
#define _ADCCMPCON6_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON6_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON6_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON6_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON6_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON6_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON6_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON6_DCMPED_POSITION              0x00000005
#define _ADCCMPCON6_DCMPED_MASK                  0x00000020
#define _ADCCMPCON6_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON6_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON6_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON6_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON6_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON6_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON6_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON6_AINID_POSITION               0x00000008
#define _ADCCMPCON6_AINID_MASK                   0x00001F00
#define _ADCCMPCON6_AINID_LENGTH                 0x00000005

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL2_POSITION                 0x00000002
#define _ADCTRGSNS_LVL2_MASK                     0x00000004
#define _ADCTRGSNS_LVL2_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL3_POSITION                 0x00000003
#define _ADCTRGSNS_LVL3_MASK                     0x00000008
#define _ADCTRGSNS_LVL3_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL4_POSITION                 0x00000004
#define _ADCTRGSNS_LVL4_MASK                     0x00000010
#define _ADCTRGSNS_LVL4_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL5_POSITION                 0x00000005
#define _ADCTRGSNS_LVL5_MASK                     0x00000020
#define _ADCTRGSNS_LVL5_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL6_POSITION                 0x00000006
#define _ADCTRGSNS_LVL6_MASK                     0x00000040
#define _ADCTRGSNS_LVL6_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL7_POSITION                 0x00000007
#define _ADCTRGSNS_LVL7_MASK                     0x00000080
#define _ADCTRGSNS_LVL7_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL8_POSITION                 0x00000008
#define _ADCTRGSNS_LVL8_MASK                     0x00000100
#define _ADCTRGSNS_LVL8_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL9_POSITION                 0x00000009
#define _ADCTRGSNS_LVL9_MASK                     0x00000200
#define _ADCTRGSNS_LVL9_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL10_POSITION                0x0000000A
#define _ADCTRGSNS_LVL10_MASK                    0x00000400
#define _ADCTRGSNS_LVL10_LENGTH                  0x00000001

