codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efh124.h
#define _CNPDJ_CNPDJ1_POSITION                   0x00000001
#define _CNPDJ_CNPDJ1_MASK                       0x00000002
#define _CNPDJ_CNPDJ1_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ2_POSITION                   0x00000002
#define _CNPDJ_CNPDJ2_MASK                       0x00000004
#define _CNPDJ_CNPDJ2_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ4_POSITION                   0x00000004
#define _CNPDJ_CNPDJ4_MASK                       0x00000010
#define _CNPDJ_CNPDJ4_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ8_POSITION                   0x00000008
#define _CNPDJ_CNPDJ8_MASK                       0x00000100
#define _CNPDJ_CNPDJ8_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ9_POSITION                   0x00000009
#define _CNPDJ_CNPDJ9_MASK                       0x00000200
#define _CNPDJ_CNPDJ9_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ11_POSITION                  0x0000000B
#define _CNPDJ_CNPDJ11_MASK                      0x00000800
#define _CNPDJ_CNPDJ11_LENGTH                    0x00000001

#define _CNPDJ_w_POSITION                        0x00000000
#define _CNPDJ_w_MASK                            0xFFFFFFFF
#define _CNPDJ_w_LENGTH                          0x00000020

#define _CNCONJ_EDGEDETECT_POSITION              0x0000000B
#define _CNCONJ_EDGEDETECT_MASK                  0x00000800
#define _CNCONJ_EDGEDETECT_LENGTH                0x00000001

#define _CNCONJ_SIDL_POSITION                    0x0000000D
#define _CNCONJ_SIDL_MASK                        0x00002000
#define _CNCONJ_SIDL_LENGTH                      0x00000001

#define _CNCONJ_ON_POSITION                      0x0000000F
#define _CNCONJ_ON_MASK                          0x00008000
#define _CNCONJ_ON_LENGTH                        0x00000001

#define _CNCONJ_w_POSITION                       0x00000000
#define _CNCONJ_w_MASK                           0xFFFFFFFF
#define _CNCONJ_w_LENGTH                         0x00000020

#define _CNENJ_CNIEJ0_POSITION                   0x00000000
#define _CNENJ_CNIEJ0_MASK                       0x00000001
#define _CNENJ_CNIEJ0_LENGTH                     0x00000001

#define _CNENJ_CNIEJ1_POSITION                   0x00000001
#define _CNENJ_CNIEJ1_MASK                       0x00000002
#define _CNENJ_CNIEJ1_LENGTH                     0x00000001

#define _CNENJ_CNIEJ2_POSITION                   0x00000002
#define _CNENJ_CNIEJ2_MASK                       0x00000004
#define _CNENJ_CNIEJ2_LENGTH                     0x00000001

#define _CNENJ_CNIEJ4_POSITION                   0x00000004
#define _CNENJ_CNIEJ4_MASK                       0x00000010
#define _CNENJ_CNIEJ4_LENGTH                     0x00000001

#define _CNENJ_CNIEJ8_POSITION                   0x00000008
#define _CNENJ_CNIEJ8_MASK                       0x00000100
#define _CNENJ_CNIEJ8_LENGTH                     0x00000001

#define _CNENJ_CNIEJ9_POSITION                   0x00000009
#define _CNENJ_CNIEJ9_MASK                       0x00000200
#define _CNENJ_CNIEJ9_LENGTH                     0x00000001

#define _CNENJ_CNIEJ11_POSITION                  0x0000000B
#define _CNENJ_CNIEJ11_MASK                      0x00000800
#define _CNENJ_CNIEJ11_LENGTH                    0x00000001

#define _CNENJ_w_POSITION                        0x00000000
#define _CNENJ_w_MASK                            0xFFFFFFFF
#define _CNENJ_w_LENGTH                          0x00000020

#define _CNSTATJ_CNSTATJ0_POSITION               0x00000000
#define _CNSTATJ_CNSTATJ0_MASK                   0x00000001
#define _CNSTATJ_CNSTATJ0_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ1_POSITION               0x00000001
#define _CNSTATJ_CNSTATJ1_MASK                   0x00000002
#define _CNSTATJ_CNSTATJ1_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ2_POSITION               0x00000002
#define _CNSTATJ_CNSTATJ2_MASK                   0x00000004
#define _CNSTATJ_CNSTATJ2_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ3_POSITION               0x00000003
#define _CNSTATJ_CNSTATJ3_MASK                   0x00000008
#define _CNSTATJ_CNSTATJ3_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ5_POSITION               0x00000005
#define _CNSTATJ_CNSTATJ5_MASK                   0x00000020
#define _CNSTATJ_CNSTATJ5_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ11_POSITION              0x0000000B
#define _CNSTATJ_CNSTATJ11_MASK                  0x00000800
#define _CNSTATJ_CNSTATJ11_LENGTH                0x00000001

#define _CNSTATJ_w_POSITION                      0x00000000
#define _CNSTATJ_w_MASK                          0xFFFFFFFF
#define _CNSTATJ_w_LENGTH                        0x00000020

#define _CNNEJ_CNNEJ0_POSITION                   0x00000000
#define _CNNEJ_CNNEJ0_MASK                       0x00000001
#define _CNNEJ_CNNEJ0_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ1_POSITION                   0x00000001
#define _CNNEJ_CNNEJ1_MASK                       0x00000002
#define _CNNEJ_CNNEJ1_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ2_POSITION                   0x00000002
#define _CNNEJ_CNNEJ2_MASK                       0x00000004
#define _CNNEJ_CNNEJ2_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ4_POSITION                   0x00000004
#define _CNNEJ_CNNEJ4_MASK                       0x00000010
#define _CNNEJ_CNNEJ4_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ8_POSITION                   0x00000008
#define _CNNEJ_CNNEJ8_MASK                       0x00000100
#define _CNNEJ_CNNEJ8_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ9_POSITION                   0x00000009
#define _CNNEJ_CNNEJ9_MASK                       0x00000200
#define _CNNEJ_CNNEJ9_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ11_POSITION                  0x0000000B
#define _CNNEJ_CNNEJ11_MASK                      0x00000800
#define _CNNEJ_CNNEJ11_LENGTH                    0x00000001

